In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'col1': ['a', 'b', 'c', 'd'],
    'col2': [1,2,3,4]
})
df

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4

In [11]:
df1 = pd.DataFrame([
    ['a', 'b', 'c', 'd'],
    [1,2,3,4]
], columns=['col1', 'col2', 'col3', 'col4'])
df1

  col1 col2 col3 col4
0    a    b    c    d
1    1    2    3    4

In [12]:
df.shape

(2, 4)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [19]:
df.describe()

           col2
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [5]:
df.index= ['_1', '_2', '_3', '_4']
df

   col1  col2
_1    a     1
_2    b     2
_3    c     3
_4    d     4

Выбор данных по индексу

In [23]:
df.loc['_2', 'col1']

'b'

In [24]:
df.loc['_2', :]

col1    b
col2    2
Name: _2, dtype: object

In [6]:
df.loc['_2':'_4', :]

   col1  col2
_2    b     2
_3    c     3
_4    d     4

In [9]:
df.loc[df['col1'] == 'b', :]

   col1  col2
_2    b     2

In [11]:
df.loc[df['col1'] == 'b', 'col2']

_2    2
Name: col2, dtype: int64

In [13]:
df.loc[df['col1'] == 'b', 'col2'].values

array([2])

In [16]:
df.loc[df['col2'] > 3, 'col1']

_4    d
Name: col1, dtype: object

In [25]:
df.loc[df['col1'].isin(['a','b']), : ]

   col1  col2
_1    a     1
_2    b     2

In [27]:
df.loc[~df['col1'].isin(['a','b']), : ]

   col1  col2
_3    c     3
_4    d     4

In [30]:
df.query('col1 == "b"')

   col1  col2
_2    b     2

In [34]:
df.query('col2 > 3')

   col1  col2
_4    d     4

Случайный выбор n-ого количества строк

In [36]:
df.sample(n = 2)

   col1  col2
_1    a     1
_4    d     4

Случайный выбор доли от исходного даиа-фрейма

In [45]:
df.sample(frac = 0.5)

   col1  col2
_4    d     4
_3    c     3

Запись и чтение

In [46]:
df.to_csv('test.csv', sep=';', index=False)

In [48]:
df_new = pd.read_csv('test.csv', sep=';')
df_new

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4